Update README.md
replacing plantuml for mermaid syntax

Signed-off-by: Raul Castellanos <castellanos.r@gmail.com>
